tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Distributed revision control system
brew "git"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Tool for managing your YubiKey configuration
brew "ykman"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Menu bar icon organizer
cask "bartender"
# Allows switching between application windows
cask "contexts"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Calendar software
cask "fantastical"
# Web browser
cask "google-chrome"
# System monitoring app
cask "istat-menus"
# Sound clear in online meetings
cask "krisp"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Email client
cask "superhuman"
# Twitter client
cask "tweetbot"
# Video communication and virtual meeting platform
cask "zoom"
