tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "hpedrorodrigues/tools"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Tool for managing your YubiKey configuration
brew "ykman"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Menu bar icon organizer
cask "bartender"
# Allows switching between application windows
cask "contexts"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Command-line utility for managing macOS dock items
cask "dockutil"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Calendar software
cask "fantastical"
# GIT client
cask "fork"
# Go (golang) IDE
cask "goland"
# Web browser
cask "google-chrome"
# System monitoring app
cask "istat-menus"
# Sound clear in online meetings
cask "krisp"
# Software for Logitech devices
cask "logi-options-plus"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Windows manager
cask "stay"
# Text editor for code, markup and prose
cask "sublime-text"
# Email client
cask "superhuman"
# Twitter client
cask "tweetbot"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
